MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F6011A/mcu.h
extern volatile C1TX0DLCBITS C1TX0DLCbits __attribute__((__sfr__));

#define C1TX0B1 C1TX0B1
extern volatile uint16_t C1TX0B1 __attribute__((__sfr__));
typedef struct tagC1TX0B1BITS {
  uint16_t TXB0D00:1;
  uint16_t TXB0D01:1;
  uint16_t TXB0D02:1;
  uint16_t TXB0D03:1;
  uint16_t TXB0D04:1;
  uint16_t TXB0D05:1;
  uint16_t TXB0D06:1;
  uint16_t TXB0D07:1;
  uint16_t TXB0D10:1;
  uint16_t TXB0D11:1;
  uint16_t TXB0D12:1;
  uint16_t TXB0D13:1;
  uint16_t TXB0D14:1;
  uint16_t TXB0D15:1;
  uint16_t TXB0D16:1;
  uint16_t TXB0D17:1;
} C1TX0B1BITS;
extern volatile C1TX0B1BITS C1TX0B1bits __attribute__((__sfr__));

#define C1TX0B2 C1TX0B2
extern volatile uint16_t C1TX0B2 __attribute__((__sfr__));
typedef struct tagC1TX0B2BITS {
  uint16_t TXB0D20:1;
  uint16_t TXB0D21:1;
  uint16_t TXB0D22:1;
  uint16_t TXB0D23:1;
  uint16_t TXB0D24:1;
  uint16_t TXB0D25:1;
  uint16_t TXB0D26:1;
  uint16_t TXB0D27:1;
  uint16_t TXB0D30:1;
  uint16_t TXB0D31:1;
  uint16_t TXB0D32:1;
  uint16_t TXB0D33:1;
  uint16_t TXB0D34:1;
  uint16_t TXB0D35:1;
  uint16_t TXB0D36:1;
  uint16_t TXB0D37:1;
} C1TX0B2BITS;
extern volatile C1TX0B2BITS C1TX0B2bits __attribute__((__sfr__));

#define C1TX0B3 C1TX0B3
extern volatile uint16_t C1TX0B3 __attribute__((__sfr__));
typedef struct tagC1TX0B3BITS {
  uint16_t TXB0D40:1;
  uint16_t TXB0D41:1;
  uint16_t TXB0D42:1;
  uint16_t TXB0D43:1;
  uint16_t TXB0D44:1;
  uint16_t TXB0D45:1;
  uint16_t TXB0D46:1;
  uint16_t TXB0D47:1;
  uint16_t TXB0D50:1;
  uint16_t TXB0D51:1;
  uint16_t TXB0D52:1;
  uint16_t TXB0D53:1;
  uint16_t TXB0D54:1;
  uint16_t TXB0D55:1;
  uint16_t TXB0D56:1;
  uint16_t TXB0D57:1;
} C1TX0B3BITS;
extern volatile C1TX0B3BITS C1TX0B3bits __attribute__((__sfr__));

#define C1TX0B4 C1TX0B4
extern volatile uint16_t C1TX0B4 __attribute__((__sfr__));
typedef struct tagC1TX0B4BITS {
  uint16_t TXB0D60:1;
  uint16_t TXB0D61:1;
  uint16_t TXB0D62:1;
  uint16_t TXB0D63:1;
  uint16_t TXB0D64:1;
  uint16_t TXB0D65:1;
  uint16_t TXB0D66:1;
  uint16_t TXB0D67:1;
  uint16_t TXB0D70:1;
  uint16_t TXB0D71:1;
  uint16_t TXB0D72:1;
  uint16_t TXB0D73:1;
  uint16_t TXB0D74:1;
  uint16_t TXB0D75:1;
  uint16_t TXB0D76:1;
  uint16_t TXB0D77:1;
} C1TX0B4BITS;
extern volatile C1TX0B4BITS C1TX0B4bits __attribute__((__sfr__));

#define C1TX0CON C1TX0CON
extern volatile uint16_t C1TX0CON __attribute__((__sfr__));
__extension__ typedef struct tagC1TX0CONBITS {
  union {
    struct {
      uint16_t TXPRI:2;
      uint16_t :1;
      uint16_t TXREQ:1;
      uint16_t TXERR:1;
      uint16_t TXLARB:1;
      uint16_t TXABT:1;
    };
    struct {
      uint16_t TXPRI0:1;
      uint16_t TXPRI1:1;
    };
  };
} C1TX0CONBITS;
extern volatile C1TX0CONBITS C1TX0CONbits __attribute__((__sfr__));

#define C1RX1SID C1RX1SID
extern volatile uint16_t C1RX1SID __attribute__((__sfr__));
__extension__ typedef struct tagC1RX1SIDBITS {
  union {
    struct {
      uint16_t RXIDE:1;
      uint16_t SRR:1;
      uint16_t SID0:1;
      uint16_t SID1:1;
      uint16_t SID2:1;
      uint16_t SID3:1;
      uint16_t SID4:1;
      uint16_t SID5:1;
      uint16_t SID6:1;
      uint16_t SID7:1;
      uint16_t SID8:1;
      uint16_t SID9:1;
      uint16_t SID10:1;
    };
    struct {
      uint16_t :2;
      uint16_t SID:11;
    };
  };
} C1RX1SIDBITS;
extern volatile C1RX1SIDBITS C1RX1SIDbits __attribute__((__sfr__));

#define C1RX1EID C1RX1EID
extern volatile uint16_t C1RX1EID __attribute__((__sfr__));
typedef struct tagC1RX1EIDBITS {
  uint16_t EID6:1;
  uint16_t EID7:1;
  uint16_t EID8:1;
  uint16_t EID9:1;
  uint16_t EID10:1;
  uint16_t EID11:1;
  uint16_t EID12:1;
  uint16_t EID13:1;
  uint16_t EID14:1;
  uint16_t EID15:1;
  uint16_t EID16:1;
  uint16_t EID17:1;
} C1RX1EIDBITS;
extern volatile C1RX1EIDBITS C1RX1EIDbits __attribute__((__sfr__));

#define C1RX1DLC C1RX1DLC
extern volatile uint16_t C1RX1DLC __attribute__((__sfr__));
__extension__ typedef struct tagC1RX1DLCBITS {
  union {
    struct {
      uint16_t DLC:4;
      uint16_t RXRB0:1;
      uint16_t :3;
      uint16_t RXRB1:1;
      uint16_t RXRTR:1;
      uint16_t EID0:1;
      uint16_t EID1:1;
      uint16_t EID2:1;
      uint16_t EID3:1;
      uint16_t EID4:1;
      uint16_t EID5:1;
    };
    struct {
      uint16_t :10;
      uint16_t EID5_0:6;
    };
    struct {
      uint16_t DLC0:1;
      uint16_t DLC1:1;
      uint16_t DLC2:1;
      uint16_t DLC3:1;
    };
  };
} C1RX1DLCBITS;
extern volatile C1RX1DLCBITS C1RX1DLCbits __attribute__((__sfr__));

#define C1RX1B1 C1RX1B1
extern volatile uint16_t C1RX1B1 __attribute__((__sfr__));
typedef struct tagC1RX1B1BITS {
  uint16_t TXB1D00:1;
  uint16_t TXB1D01:1;
  uint16_t TXB1D02:1;
  uint16_t TXB1D03:1;
  uint16_t TXB1D04:1;
  uint16_t TXB1D05:1;
  uint16_t TXB1D06:1;
  uint16_t TXB1D07:1;
  uint16_t TXB1D10:1;
  uint16_t TXB1D11:1;
  uint16_t TXB1D12:1;
  uint16_t TXB1D13:1;
  uint16_t TXB1D14:1;
  uint16_t TXB1D15:1;
  uint16_t TXB1D16:1;
  uint16_t TXB1D17:1;
} C1RX1B1BITS;
extern volatile C1RX1B1BITS C1RX1B1bits __attribute__((__sfr__));

#define C1RX1B2 C1RX1B2
extern volatile uint16_t C1RX1B2 __attribute__((__sfr__));
typedef struct tagC1RX1B2BITS {
  uint16_t TXB1D20:1;
  uint16_t TXB1D21:1;
  uint16_t TXB1D22:1;
  uint16_t TXB1D23:1;
  uint16_t TXB1D24:1;
  uint16_t TXB1D25:1;
  uint16_t TXB1D26:1;
  uint16_t TXB1D27:1;
  uint16_t TXB1D30:1;
  uint16_t TXB1D31:1;
  uint16_t TXB1D32:1;
  uint16_t TXB1D33:1;
  uint16_t TXB1D34:1;
  uint16_t TXB1D35:1;
  uint16_t TXB1D36:1;
  uint16_t TXB1D37:1;
} C1RX1B2BITS;
extern volatile C1RX1B2BITS C1RX1B2bits __attribute__((__sfr__));

#define C1RX1B3 C1RX1B3
extern volatile uint16_t C1RX1B3 __attribute__((__sfr__));
typedef struct tagC1RX1B3BITS {
  uint16_t TXB1D40:1;
  uint16_t TXB1D41:1;
  uint16_t TXB1D42:1;
  uint16_t TXB1D43:1;
  uint16_t TXB1D44:1;
  uint16_t TXB1D45:1;
  uint16_t TXB1D46:1;
  uint16_t TXB1D47:1;
  uint16_t TXB1D50:1;
  uint16_t TXB1D51:1;
  uint16_t TXB1D52:1;
  uint16_t TXB1D53:1;
  uint16_t TXB1D54:1;
  uint16_t TXB1D55:1;
  uint16_t TXB1D56:1;
  uint16_t TXB1D57:1;
} C1RX1B3BITS;
extern volatile C1RX1B3BITS C1RX1B3bits __attribute__((__sfr__));

#define C1RX1B4 C1RX1B4
extern volatile uint16_t C1RX1B4 __attribute__((__sfr__));
typedef struct tagC1RX1B4BITS {
  uint16_t TXB1D60:1;
  uint16_t TXB1D61:1;
  uint16_t TXB1D62:1;
  uint16_t TXB1D63:1;
  uint16_t TXB1D64:1;
  uint16_t TXB1D65:1;
  uint16_t TXB1D66:1;
  uint16_t TXB1D67:1;
  uint16_t TXB1D70:1;
  uint16_t TXB1D71:1;
  uint16_t TXB1D72:1;
  uint16_t TXB1D73:1;
  uint16_t TXB1D74:1;
  uint16_t TXB1D75:1;
  uint16_t TXB1D76:1;
  uint16_t TXB1D77:1;
} C1RX1B4BITS;
