MikroElektronika/core_packages/dsPIC/XC16/def/dsPIC30F6011A/mcu.h
#define _C2TX1B2_TXB1D37_POSITION                0x0000000F
#define _C2TX1B2_TXB1D37_MASK                    0x00008000
#define _C2TX1B2_TXB1D37_LENGTH                  0x00000001

#define _C2TX1B3_TXB1D40_POSITION                0x00000000
#define _C2TX1B3_TXB1D40_MASK                    0x00000001
#define _C2TX1B3_TXB1D40_LENGTH                  0x00000001

#define _C2TX1B3_TXB1D41_POSITION                0x00000001
#define _C2TX1B3_TXB1D41_MASK                    0x00000002
#define _C2TX1B3_TXB1D41_LENGTH                  0x00000001

#define _C2TX1B3_TXB1D42_POSITION                0x00000002
#define _C2TX1B3_TXB1D42_MASK                    0x00000004
#define _C2TX1B3_TXB1D42_LENGTH                  0x00000001

#define _C2TX1B3_TXB1D43_POSITION                0x00000003
#define _C2TX1B3_TXB1D43_MASK                    0x00000008
#define _C2TX1B3_TXB1D43_LENGTH                  0x00000001

#define _C2TX1B3_TXB1D44_POSITION                0x00000004
#define _C2TX1B3_TXB1D44_MASK                    0x00000010
#define _C2TX1B3_TXB1D44_LENGTH                  0x00000001

#define _C2TX1B3_TXB1D45_POSITION                0x00000005
#define _C2TX1B3_TXB1D45_MASK                    0x00000020
#define _C2TX1B3_TXB1D45_LENGTH                  0x00000001

#define _C2TX1B3_TXB1D46_POSITION                0x00000006
#define _C2TX1B3_TXB1D46_MASK                    0x00000040
#define _C2TX1B3_TXB1D46_LENGTH                  0x00000001

#define _C2TX1B3_TXB1D47_POSITION                0x00000007
#define _C2TX1B3_TXB1D47_MASK                    0x00000080
#define _C2TX1B3_TXB1D47_LENGTH                  0x00000001

#define _C2TX1B3_TXB1D50_POSITION                0x00000008
#define _C2TX1B3_TXB1D50_MASK                    0x00000100
#define _C2TX1B3_TXB1D50_LENGTH                  0x00000001

#define _C2TX1B3_TXB1D51_POSITION                0x00000009
#define _C2TX1B3_TXB1D51_MASK                    0x00000200
#define _C2TX1B3_TXB1D51_LENGTH                  0x00000001

#define _C2TX1B3_TXB1D52_POSITION                0x0000000A
#define _C2TX1B3_TXB1D52_MASK                    0x00000400
#define _C2TX1B3_TXB1D52_LENGTH                  0x00000001

#define _C2TX1B3_TXB1D53_POSITION                0x0000000B
#define _C2TX1B3_TXB1D53_MASK                    0x00000800
#define _C2TX1B3_TXB1D53_LENGTH                  0x00000001

#define _C2TX1B3_TXB1D54_POSITION                0x0000000C
#define _C2TX1B3_TXB1D54_MASK                    0x00001000
#define _C2TX1B3_TXB1D54_LENGTH                  0x00000001

#define _C2TX1B3_TXB1D55_POSITION                0x0000000D
#define _C2TX1B3_TXB1D55_MASK                    0x00002000
#define _C2TX1B3_TXB1D55_LENGTH                  0x00000001

#define _C2TX1B3_TXB1D56_POSITION                0x0000000E
#define _C2TX1B3_TXB1D56_MASK                    0x00004000
#define _C2TX1B3_TXB1D56_LENGTH                  0x00000001

#define _C2TX1B3_TXB1D57_POSITION                0x0000000F
#define _C2TX1B3_TXB1D57_MASK                    0x00008000
#define _C2TX1B3_TXB1D57_LENGTH                  0x00000001

#define _C2TX1B4_TXB1D60_POSITION                0x00000000
#define _C2TX1B4_TXB1D60_MASK                    0x00000001
#define _C2TX1B4_TXB1D60_LENGTH                  0x00000001

#define _C2TX1B4_TXB1D61_POSITION                0x00000001
#define _C2TX1B4_TXB1D61_MASK                    0x00000002
#define _C2TX1B4_TXB1D61_LENGTH                  0x00000001

#define _C2TX1B4_TXB1D62_POSITION                0x00000002
#define _C2TX1B4_TXB1D62_MASK                    0x00000004
#define _C2TX1B4_TXB1D62_LENGTH                  0x00000001

#define _C2TX1B4_TXB1D63_POSITION                0x00000003
#define _C2TX1B4_TXB1D63_MASK                    0x00000008
#define _C2TX1B4_TXB1D63_LENGTH                  0x00000001

#define _C2TX1B4_TXB1D64_POSITION                0x00000004
#define _C2TX1B4_TXB1D64_MASK                    0x00000010
#define _C2TX1B4_TXB1D64_LENGTH                  0x00000001

#define _C2TX1B4_TXB1D65_POSITION                0x00000005
#define _C2TX1B4_TXB1D65_MASK                    0x00000020
#define _C2TX1B4_TXB1D65_LENGTH                  0x00000001

#define _C2TX1B4_TXB1D66_POSITION                0x00000006
#define _C2TX1B4_TXB1D66_MASK                    0x00000040
#define _C2TX1B4_TXB1D66_LENGTH                  0x00000001

#define _C2TX1B4_TXB1D67_POSITION                0x00000007
#define _C2TX1B4_TXB1D67_MASK                    0x00000080
#define _C2TX1B4_TXB1D67_LENGTH                  0x00000001

#define _C2TX1B4_TXB1D70_POSITION                0x00000008
#define _C2TX1B4_TXB1D70_MASK                    0x00000100
#define _C2TX1B4_TXB1D70_LENGTH                  0x00000001

#define _C2TX1B4_TXB1D71_POSITION                0x00000009
#define _C2TX1B4_TXB1D71_MASK                    0x00000200
#define _C2TX1B4_TXB1D71_LENGTH                  0x00000001

#define _C2TX1B4_TXB1D72_POSITION                0x0000000A
#define _C2TX1B4_TXB1D72_MASK                    0x00000400
#define _C2TX1B4_TXB1D72_LENGTH                  0x00000001

#define _C2TX1B4_TXB1D73_POSITION                0x0000000B
#define _C2TX1B4_TXB1D73_MASK                    0x00000800
#define _C2TX1B4_TXB1D73_LENGTH                  0x00000001

#define _C2TX1B4_TXB1D74_POSITION                0x0000000C
#define _C2TX1B4_TXB1D74_MASK                    0x00001000
#define _C2TX1B4_TXB1D74_LENGTH                  0x00000001

#define _C2TX1B4_TXB1D75_POSITION                0x0000000D
#define _C2TX1B4_TXB1D75_MASK                    0x00002000
#define _C2TX1B4_TXB1D75_LENGTH                  0x00000001

#define _C2TX1B4_TXB1D76_POSITION                0x0000000E
#define _C2TX1B4_TXB1D76_MASK                    0x00004000
#define _C2TX1B4_TXB1D76_LENGTH                  0x00000001

#define _C2TX1B4_TXB1D77_POSITION                0x0000000F
#define _C2TX1B4_TXB1D77_MASK                    0x00008000
#define _C2TX1B4_TXB1D77_LENGTH                  0x00000001

#define _C2TX1CON_TXPRI_POSITION                 0x00000000
#define _C2TX1CON_TXPRI_MASK                     0x00000003
#define _C2TX1CON_TXPRI_LENGTH                   0x00000002

#define _C2TX1CON_TXREQ_POSITION                 0x00000003
#define _C2TX1CON_TXREQ_MASK                     0x00000008
#define _C2TX1CON_TXREQ_LENGTH                   0x00000001

